# HorizontalCurveEndpoint Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HorizontalCurveEndpoint Class
Members See Also
---
Represents an endpoint (start or end) of a horizontal curve in Alignment geometry.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public class HorizontalCurveEndpoint
```

Visual Basic
---
```text
Public Class HorizontalCurveEndpoint
```

Visual C++
---
```text
public ref class HorizontalCurveEndpoint
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Infrastructure..::..HorizontalCurveEndpoint
# See Also
HorizontalCurveEndpoint Members
Autodesk.Revit.DB.Infrastructure Namespace